Revit 2024 API
AnalysisDisplayStyle.HasDeformedShapeSettings Method
 If true style has deformed shape settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool HasDeformedShapeSettings()
Visual Basic
Public Function HasDeformedShapeSettings As Boolean
Visual C++
public:
bool HasDeformedShapeSettings()
See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace